use rand::seq::IndexedRandom;

pub fn random_word() -> String{
    const WORDS: [&str; 182] = ["время", "жизнь", "слово", "место", "конец", "часть", "город", "земля", "право", "дверь", "образ", "закон", "война", 
    "книга", "число", "народ", "форма", "связь", "улица", "вечер", "мысль", "месяц", "школа", "театр", "рубль", "смысл", "орган", "рынок", "семья", 
    "центр", "ответ", "автор", "стена", "совет", "глава", "наука", "плечо", "точка", "палец", "номер", "метод", "фильм", "гость", "кровь", "район", 
    "армия", "класс", "герой", "спина", "сцена", "объем", "берег", "фирма", "завод", "песня", "роман", "стихи", "повод", "успех", "выход", "текст", 
    "пункт", "линия", "среда", "волос", "ветер", "огонь", "грудь", "страх", "сумма", "сфера", "мужик", "немец", "выбор", "масса", "слава", "кухня", 
    "отдел", "товар", "актер", "слеза", "вывод", "норма", "рамка", "прием", "режим", "целое", "вирус", "поиск", "налог", "доход", "карта", "акция", 
    "сосед", "фраза", "толпа", "схема", "волна", "птица", "запах", "водка", "поезд", "адрес", "лидер", "стиль", "весна", "эпоха", "запад", "тайна", 
    "трава", "фронт", "музей", "князь", "сутки", "судья", "крыша", "поток", "честь", "еврей", "сотня", "дождь", "труба", "осень", "пьеса", "черта", 
    "кусок", "билет", "масло", "экран", "канал", "вагон", "дурак", "сезон", "запас", "длина", "крыло", "округ", "доска", "полет", "пакет", "живот", 
    "смена", "порог", "буква", "лодка", "серия", "шутка", "кулак", "нефть", "цифра", "сапог", "жилье", "мешок", "отказ", "замок", "диван", "добро", 
    "покой", "кость", "спорт", "майор", "отдых", "ручка", "мечта", "сюжет", "рубеж", "крест", "взрыв", "почва", "заказ", "штука", "сумка", "хвост", 
    "песок", "озеро", "строй", "дочка", "танец", "набор", "горло", "плата", "голос"];

    WORDS.choose(&mut rand::rng()).unwrap().to_string()
}